#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_dev.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=29935c7c-1439-4665-9d86-02672a8d71ad]
module.keycloak_dev.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=465edd6a-aaa8-4c49-a042-53a56798f582]
module.keycloak_dev.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=324970c7-bdb6-4f3e-8f8d-797e7d010ac7]
module.keycloak_dev.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=b54e506f-f9ec-4168-8c28-5f0b19c4ecd0]
module.keycloak_dev.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=027a0e5a-ec26-4d4b-a7c1-38c74d3927f4]
module.keycloak_dev.module.onestopauth.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=3128beca-d686-491b-a8ca-1ad82f7c0680]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1-67.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7017b236-dc19-4c88-9857-d477401c40e2]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1-67.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=a7117d5c-cbb3-47d5-8b99-4249f571cc06]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1-67.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=933a0e75-3fd3-4a1c-ac63-0f6e2dca78ba]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1-67.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b3e38067-b053-4699-983b-c3f74a8ac126]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1-67.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=c94e40dd-b1b3-42cf-af92-60a06d1a7245]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1-67.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=015992cf-36b5-4f54-8bb9-ac4a64bb8dab]
module.keycloak_test.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=bdb011bf-561b-48bb-bda4-dd568280e31f]
module.keycloak_test.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=6a3e3d19-036a-4abd-9b2c-ee1e5094bb51]
module.keycloak_test.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=ab394989-a8f2-425c-a1e2-2fac53eccb32]
module.keycloak_test.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3571b37c-1181-43d9-b37e-01fbafd92421]
module.keycloak_test.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2d7aa8d1-63d1-436b-a556-bfb2702ebbc2]
module.keycloak_test.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=0946a9f6-b418-434c-979c-a03b865a3597]
module.keycloak_test.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=bc415c7a-fce1-4ce5-9916-8b28879ca671]
module.keycloak_test.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=aa54bd66-7db0-4edf-aef5-d59c1be7c01a]
module.keycloak_test.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d5dcccb6-11fc-4959-891f-eb913d465e90]
module.keycloak_test.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=02a3db30-2c0e-45e1-965e-bd2f527c30d2]
module.keycloak_test.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=28494fbf-480a-4bbf-bc13-576e074c197d]
module.keycloak_test.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=d1ab7822-ae59-4b13-bec4-b507bd5dd51a]
module.keycloak_test.module.onestopauth.module.client_taft-133.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=dd3584fd-5180-4c3a-81a2-ae7097d931b9]
module.keycloak_test.module.onestopauth.module.client_taft-133.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=36cb7271-c10c-46e0-9377-1a19334fe91a]
module.keycloak_test.module.onestopauth.module.client_taft-133.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=5e5219c7-b715-41b2-a0f3-08b93de637cf]
module.keycloak_test.module.onestopauth.module.client_taft-133.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=ca3a3a5e-12a6-476f-958d-ea7275f23ed1]
module.keycloak_test.module.onestopauth.module.client_taft-133.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=4dac9412-e733-45c4-83b9-5656398dd729]
module.keycloak_test.module.onestopauth.module.client_taft-133.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=0ece09ee-4846-40d9-8aae-b167b198baf4]
module.keycloak_test.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ccee6b0d-a27d-45c7-afad-c4dfd345e614]
module.keycloak_test.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=0b955a72-4cb1-4e12-b22b-d4e669dd18b9]
module.keycloak_test.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=0e689aa1-a2ce-4c30-b366-7e79238036a3]
module.keycloak_test.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=b39ea164-2a54-487a-9e70-e24bb8725b05]
module.keycloak_test.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=47288847-b2d5-4398-8491-7e80aa875e90]
module.keycloak_test.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=d7e50097-5bff-4e3e-b239-f1145d6e5753]
module.keycloak_test.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=af4c3876-a275-4eeb-963f-73c505e2923e]
module.keycloak_test.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e63c3de9-dad6-4441-9614-93176ff61d97]
module.keycloak_test.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7e3e3945-86e4-48e0-8c60-c9536073e55e]
module.keycloak_test.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=61f7d821-3022-45a1-aa7d-1217862083eb]
module.keycloak_test.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=ef6ef143-6ed3-4f32-bc6a-27779bcd9f0b]
module.keycloak_test.module.onestopauth.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=4df5b321-c4b5-4cb5-961b-3b01d71470f1]
module.keycloak_test.module.onestopauth.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=153d5614-3ea8-4313-beb3-0abaa48d82c0]
module.keycloak_test.module.onestopauth.module.client_test-client.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=12d6a292-7d42-42f9-8e4c-7ca0bac367fc]
module.keycloak_test.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=9b32d38f-0fa1-444d-9758-c983f4b34fd0]
module.keycloak_test.module.onestopauth.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=cd5ed191-1023-443d-a5ce-9e8d4cc4cb6c]
module.keycloak_test.module.onestopauth.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=085b8be1-5041-4081-a3aa-d1a3c334a7f5]
module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=036873cc-1079-4bcc-8d80-28fa3eae032e]
module.keycloak_test.module.onestopauth.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b033767f-c3f0-4cc7-8a3a-358d280c4904]
module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=24194681-e44b-4bb4-890e-f52025105f67]
module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=32e4d193-e002-466b-9494-9fc499be1ddd]
module.keycloak_test.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=5464af2a-dee3-41a6-816d-021bf5947753]
module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=0dd0e9a1-17a5-4289-9e6b-b7bcf38a831e]
module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=5d5f9440-3e5f-49b8-a1bb-8a5229dccc16]
module.keycloak_test.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=47adddae-1f15-494f-a779-2aa73d2fa5e1]
module.keycloak_test.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=c3f08da7-36c2-4514-b0d9-624cc4ba7e65]
module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=6bd54c02-2628-489d-aa5c-3d027abb45da]
module.keycloak_test.module.onestopauth.module.client_jon-test-1-67.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=72eb70ba-2b0b-459c-92c8-71bb5a980c5c]
module.keycloak_test.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=8d8b346b-2428-416c-8a93-46d81fe1624a]
module.keycloak_test.module.onestopauth.module.client_jon-test-1-67.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=6a63b68f-489a-473c-abe5-01714b668553]
module.keycloak_test.module.onestopauth.module.client_jon-test-1-67.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=a811d022-15be-47c6-b620-ad327b48d043]
module.keycloak_test.module.onestopauth.module.client_jon-test-1-67.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=9b8ddf42-d4c4-4663-862d-b5b55c9a5284]
module.keycloak_test.module.onestopauth.module.client_jon-test-1-67.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f8015578-183f-4d7d-bfef-1892dbe78732]
module.keycloak_test.module.onestopauth.module.client_jon-test-1-67.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=3478102e-0ce2-4feb-b422-e274ff442158]
module.keycloak_test.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=934f5472-219a-417d-8ec5-8aa7bf64c206]
module.keycloak_test.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=a784fbba-d62c-4d46-922d-6ed7e7a46f5f]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth.module.client_trevor-test-397.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_trevor-test-397.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_trevor-test-397.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_trevor-test-397.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "trevor-test-397"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_trevor-test-397.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_trevor-test-397.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_trevor-test-397.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "trevor-test-397"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "trevor-test-397"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://fmdbd.hlth.gov.bc.ca",
        ]
    }

  # module.keycloak_prod.module.onestopauth.module.client_trevor-test-397.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_trevor-test-397.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_trevor-test-397.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_trevor-test-397.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "trevor-test-397"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_trevor-test-397.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_trevor-test-397.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_trevor-test-397.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "trevor-test-397"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "trevor-test-397"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://fmdb.hlth.gov.bc.ca",
        ]
    }

  # module.keycloak_test.module.onestopauth.module.client_trevor-test-397.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_trevor-test-397.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_trevor-test-397.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_trevor-test-397.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "trevor-test-397"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_trevor-test-397.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_trevor-test-397.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_trevor-test-397.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "trevor-test-397"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "trevor-test-397"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://fmdbt.hlth.gov.bc.ca",
        ]
    }

Plan: 21 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Resources: 0 of 256 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*